# python3 -m venv .folder    -Создание пространства
# python (main.py)-название файла   -Запуск программы или ctrl+f5
# ---------------------------------------
# int   -целые числа
# float -дробные числа
# bool  -логический тип данных (true/false)
# str   -строка
# ---------------------------------------
# #  -коммит
# """        в начале
# ревр
# """        в конце
# Выделить нужные строки - (ctrl+k)(ctrl+c)      коммент всех выделенных строк

# Что бы раскомментить   - (ctrl+k)(ctrl+u)              
# ---------------------------------------
# Для вывода:
# print(f"{a} - {b} - {c}")
# print("{} - {} - {}".format(a,b,c))

# Для ввода:
# print('Введите первое число: ')
# a = input()
# print(a)
# ---------------------------------------
# print('Введите первое число: ')
# a = input()

# b = input('Введите второе число: ')

# print(a)
# ---------------------------------------
# Отброс дробной части с помощью INT:

# c = 5.89
# print(c)
# n = int(c)
# print(n)
# ---------------------------------------
# Целочисленное значение INT:
# c = 5.89
# print(c)
# print(type(c))
# c = int(c)
# print(c)
# print(type(c))
# ---------------------------------------
# Строка STR:
# c = 5.89
# print(c)
# print(type(c))
# c = str(c)
# print(c + '89')
# print(type(c))
# --------------------------------------
# Система BOOL для true/falce:
# c = 1
# print(c)
# print(type(c))
# c = bool(c)
# print(c)
# print(type(c))
# --------------------------------------
# Сложение:

# print('Введите первое число: ')
# a = int(input())

# b = int(input('Введите второе число: '))

# print(a, ' + ', b, ' = ', a + b)
# ----------------------------------------
# Умножение с выводом 2х-3х чисел послее запятой:
# a = 5.898956
# b = 6.46336
# print(round(a*b, 2))
# ----------------------------------------
# inter = 2    
# inter += 3  #   iter = iter + 3
# inter -= 4  #   iter = iter - 4
# inter *= 5  #   iter = iter * 5
# inter /= 6  #   iter = iter / 6
# inter //= 7 #   iter = iter // 7
# inter %= 8  #   iter = iter % 8
# inter **= 9 #   iter = iter ** 9

# ------------------------------------------
# if condition1 and condition2: выполнится, когда оба условия окажутся верными
# 	operator
# if conditiona3 and condition4: выполнится, когда хотя бы одно из условий окажется верными
# 	operator
# --------------------------------------------
# username = input('Введите ваше имя: ')
# if username == 'Маша':
#     print('Ура, это же МАША!')
# elif username == 'Татьяна':
#     print('Моя БОГИНЯ!!!')
# elif username == 'Андрей':
#     print('Привет Андрюха!')
# else:
#     print('Привет, ', username)
# ------------------------------------------
# Проход по всем строкам:
# a = 'qwerty'
# for i in a:
# 	print(i)
# -----------------------------------------
# line = ""
# for i in range(5):
# 	line = ""
# 	for j in range(5):
# 	    line += "*"
# 	print(line)
# ---------------------------------------------
# n = 423
# summa = 0
# while n > 0:
#     x = n % 10
#     summa = summa + x
#                 n = n // 10
#     print(summa) 